; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v8 ?v6)
             (pred_4 ?v4 ?v9)
             (pred_7 ?v8 ?v9)
             (pred_2 ?v3 ?v8 )
	     (pred_10 ?v8)
             (pred_8 ?v10)
             (pred_1 ?v4)
             (pred_3 ?v9)
             (pred_6 ?v8)
             (pred_9 ?v4)
             (pred_11 ?v8)
             (pred_12 ))



(:action op_5
:parameters (?v11 ?v1 ?v5 ?v7)
:precondition (and (pred_8 ?v11) (pred_8 ?v1) (pred_1 ?v5) (pred_3 ?v7)
          (pred_5 ?v11 ?v1) (pred_4 ?v5 ?v7)
                   (pred_7 ?v1 ?v7) (pred_10 ?v11) 
                   (pred_6 ?v1) (pred_9 ?v5))
:effect (and  (pred_11 ?v1) (not (pred_6 ?v1))))


(:action op_2
:parameters (?v11 ?v13)
:precondition (and (pred_8 ?v11) (pred_8 ?v13)
               (pred_10 ?v11) (pred_5 ?v11 ?v13) (pred_11 ?v13))
:effect (and (pred_10 ?v13) (not (pred_10 ?v11))))

(:action op_3
:parameters (?v11 ?v5)
:precondition (and (pred_8 ?v11) (pred_1 ?v5) 
                  (pred_10 ?v11) (pred_2 ?v5 ?v11) (pred_12 ))
:effect (and (pred_9 ?v5)
   (not (pred_2 ?v5 ?v11)) (not (pred_12 ))))


(:action op_4
:parameters (?v11 ?v2 ?v12)
:precondition (and (pred_8 ?v11) (pred_1 ?v2) (pred_1 ?v12)
                  (pred_10 ?v11) (pred_9 ?v12) (pred_2 ?v2 ?v11))
:effect (and (pred_9 ?v2) (pred_2 ?v12 ?v11)
        (not (pred_9 ?v12)) (not (pred_2 ?v2 ?v11))))

(:action op_1
:parameters (?v11 ?v5)
:precondition (and (pred_8 ?v11) (pred_1 ?v5) 
                  (pred_10 ?v11) (pred_9 ?v5))
:effect (and (pred_12 ) (pred_2 ?v5 ?v11) (not (pred_9 ?v5)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_07 obj_19 obj_10 obj_17 obj_03 obj_13 obj_16 obj_12 obj_01 obj_20 obj_06 obj_11 obj_02 obj_04 obj_18 obj_08
    obj_14 obj_09
    obj_05 obj_15 obj_21
    )

    (:init
       (pred_12)

       (pred_8 obj_07)
       (pred_8 obj_19)
       (pred_8 obj_10)
       (pred_8 obj_17)
       (pred_8 obj_03)
       (pred_8 obj_13)
       (pred_8 obj_16)
       (pred_8 obj_12)
       (pred_8 obj_01)
       (pred_8 obj_20)
       (pred_8 obj_06)
       (pred_8 obj_11)
       (pred_8 obj_02)
       (pred_8 obj_04)
       (pred_8 obj_18)
       (pred_8 obj_08)
       (pred_3 obj_14)
       (pred_3 obj_09)
       (pred_1 obj_05)
       (pred_1 obj_15)
       (pred_1 obj_21)

       (pred_5 obj_07 obj_03)
       (pred_5 obj_07 obj_19)
       (pred_5 obj_19 obj_13)
       (pred_5 obj_19 obj_10)
       (pred_5 obj_19 obj_07)
       (pred_5 obj_10 obj_16)
       (pred_5 obj_10 obj_17)
       (pred_5 obj_10 obj_19)
       (pred_5 obj_17 obj_12)
       (pred_5 obj_17 obj_10)
       (pred_5 obj_03 obj_01)
       (pred_5 obj_03 obj_13)
       (pred_5 obj_03 obj_07)
       (pred_5 obj_13 obj_20)
       (pred_5 obj_13 obj_16)
       (pred_5 obj_13 obj_19)
       (pred_5 obj_13 obj_03)
       (pred_5 obj_16 obj_06)
       (pred_5 obj_16 obj_12)
       (pred_5 obj_16 obj_10)
       (pred_5 obj_16 obj_13)
       (pred_5 obj_12 obj_11)
       (pred_5 obj_12 obj_17)
       (pred_5 obj_12 obj_16)
       (pred_5 obj_01 obj_02)
       (pred_5 obj_01 obj_20)
       (pred_5 obj_01 obj_03)
       (pred_5 obj_20 obj_04)
       (pred_5 obj_20 obj_06)
       (pred_5 obj_20 obj_13)
       (pred_5 obj_20 obj_01)
       (pred_5 obj_06 obj_18)
       (pred_5 obj_06 obj_11)
       (pred_5 obj_06 obj_16)
       (pred_5 obj_06 obj_20)
       (pred_5 obj_11 obj_08)
       (pred_5 obj_11 obj_12)
       (pred_5 obj_11 obj_06)
       (pred_5 obj_02 obj_04)
       (pred_5 obj_02 obj_01)
       (pred_5 obj_04 obj_18)
       (pred_5 obj_04 obj_20)
       (pred_5 obj_04 obj_02)
       (pred_5 obj_18 obj_08)
       (pred_5 obj_18 obj_06)
       (pred_5 obj_18 obj_04)
       (pred_5 obj_08 obj_11)
       (pred_5 obj_08 obj_18)
       (pred_6 obj_13)
       (pred_6 obj_18)
       (pred_6 obj_17)
       (pred_7  obj_13 obj_14)
       (pred_7  obj_18 obj_09)
       (pred_7  obj_17 obj_14)
       (pred_11 obj_07)
       (pred_11 obj_19)
       (pred_11 obj_10)
       (pred_11 obj_03)
       (pred_11 obj_16)
       (pred_11 obj_12)
       (pred_11 obj_01)
       (pred_11 obj_20)
       (pred_11 obj_06)
       (pred_11 obj_11)
       (pred_11 obj_02)
       (pred_11 obj_04)
       (pred_11 obj_08)

       (pred_4  obj_05 obj_14)
       (pred_4  obj_15 obj_09)
       (pred_4  obj_21 obj_09)
       (pred_2 obj_05 obj_19)
       (pred_2 obj_15 obj_16)
       (pred_2 obj_21 obj_17)
       (pred_10 obj_07)
    )

    (:goal (and
       (pred_2 obj_05 obj_20)
       (pred_2 obj_15 obj_10)
    ))
(:constraints
  (always (not (pred_10 obj_06)))
)
)

; plan
1. (op_2 obj_07 obj_19)
   deleted: (pred_10 obj_07)
   added: (pred_10 obj_19)
   goals met: 0 of 2
2. (op_2 obj_19 obj_10)
   deleted: (pred_10 obj_19)
   added: (pred_10 obj_10)
   goals met: 0 of 2
3. (op_2 obj_10 obj_16)
   deleted: (pred_10 obj_10)
   added: (pred_10 obj_16)
   goals met: 0 of 2
4. (op_3 obj_16 obj_15)
   deleted: (pred_2 obj_15 obj_16) (pred_12)
   added: (pred_9 obj_15)
   goals met: 0 of 2
5. (op_2 obj_16 obj_10)
   deleted: (pred_10 obj_16)
   added: (pred_10 obj_10)
   goals met: 0 of 2
6. (op_1 obj_10 obj_15)
   deleted: (pred_9 obj_15)
   added: (pred_12) (pred_2 obj_15 obj_10)
   goals met: 1 of 2
7. (op_2 obj_10 obj_19)
   deleted: (pred_10 obj_10)
   added: (pred_10 obj_19)
   goals met: 1 of 2
8. (op_3 obj_19 obj_05)
   deleted: (pred_2 obj_05 obj_19) (pred_12)
   added: (pred_9 obj_05)
   goals met: 1 of 2
9. (op_5 obj_19 obj_13 obj_05 obj_14)
   deleted: (pred_6 obj_13)
   added: (pred_11 obj_13)
   goals met: 1 of 2
10. (op_2 obj_19 obj_13)
   deleted: (pred_10 obj_19)
   added: (pred_10 obj_13)
   goals met: 1 of 2
11. (op_2 obj_13 obj_20)
   deleted: (pred_10 obj_13)
   added: (pred_10 obj_20)
   goals met: 1 of 2
12. (op_1 obj_20 obj_05)
   deleted: (pred_9 obj_05)
   added: (pred_12) (pred_2 obj_05 obj_20)
   goals met: 2 of 2
